{
  "Projects": [
    {
      "Title": "ProjectsIncluded",
      "Image": "images/jpg/placeholder.jpg",
      "MyRole": "Founder",
      "Pinned": true,
      "Date": {
        "StartDate": "Jan. 2024",
        "EndDate": null
      },
      "Body": {
        "Text": "ProjectsIncluded is my own startup I'm working on which is currently in the form of a sideproject. The idea is to create a 'Scaling as a Service' platform with well tested templates so developers can setup a secure, highly scalable server, within seconds from both a webinterface and a CLI.",
        "List": null
      }
    },
    {
      "Title": "Airline Booking System",
      "Image": "images/webp/rara.webp",
      "MyRole": "Developer",
      "Pinned": false,
      "Date": {
        "StartDate": "Apr. 2023",
        "EndDate": "Jul. 2023"
      },
      "Body": {
        "Text": "This project was a project for my study where we needed to make a booking system for the terminal, with C#. This system would need to include Unit Tests and beyond the expectations of the study I've made a complete mockconsole. This solution simulated the functionalies from 'System.Console' which made Github Actions able to run all our tests, including GUI tests, instead. This saved our project group hours of work.",
        "List": null
      }
    },
    {
      "Title": "PostForward",
      "Image": "images/jpg/placeholder.jpg",
      "MyRole": "Developer",
      "Pinned": false,
      "Date": {
        "StartDate": "Apr. 2023",
        "EndDate": "Jun. 2023"
      },
      "Body": {
        "Text": "This project was a fun, quick, project where I made a simple redirect system using only ExpressJS. The problem was that we had around 5 different nodes which each had their own API implementation as they were made by different development teams. This custom adapter I wrote was the perfect fit as this made us able to communicate to any outside server which allowed POST requests.",
        "List": null
      }
    },
    {
      "Title": "Serverless-AWS-GCP",
      "Image": "images/jpg/placeholder.jpg",
      "MyRole": "Developer",
      "Pinned": false,
      "Date": {
        "StartDate": "Apr 2020",
        "EndDate": "Jul 2020"
      },
      "Body": {
        "Text": "Serverless-AWS-GCP was the project I needed to create for my internship from my 1st study. The thought was that the company I worked for at the time liked to explore different cloud solutions to see if one of them would be a viable alternative for customer data. The goal was to be able to easily switch between cloud providers in case it was needed. That's why I created a serverless adapter which you can change from 'mode' to deploy the same data somewhere else within a reasonable timeframe. This was an awesome project to work on considering I never really touched cloud solutions. I finished my internship with a 10/10.",
        "List": null
      }
    }
  ]
}
